AshanMadusanka/stm32f746xx-drivers/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h>
#include <string.h>

#include "stm32f746xx.h"


/** SPI1 Pins  ALT5
 * PA4 --->NSS
 * PA5--->SCK
 * PA6--->MISO
 * PA7--->MOSI
 */
void SPI_GpioInit();
void SPI1_Inits();

void Delay() {
    for (uint32_t i = 0; i < 500000; i++) {
        // Simple delay loop
    }
}

int main(void) {

    char user_data[] = "Hello world.....";

    SPI_GpioInit();
    SPI1_Inits();

    SPI_SSOEConfig(SPI1, ENABLE);

    SPI_PeripheralControl(SPI1, ENABLE);

    while(1){


    uint8_t data_length = strlen(user_data);
    SPI_SendData(SPI1, &data_length, 1);
   // Delay();
    SPI_SendData(SPI1, ((uint8_t*)user_data), strlen(user_data));

	//lets confirm SPI is not busy
	while( SPI_GetFlagStatus(SPI1,SPI_BUSY_FLAG) );

	//Disable the SPI2 peripheral
	//SPI_PeripheralControl(SPI1,DISABLE);
	Delay();
    }

 //   while(1);

}

void SPI_GpioInit() {

    GPIO_Handle_t SPIPins;

    SPIPins.pGPIOx = GPIOA; // Use GPIOA for SPI1
    SPIPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALT; // Set to alternate function mode
    SPIPins.GPIO_PinConfig.GPIO_PinAltFunMode = 5; // Alternate function for SPI1
    SPIPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP; // Push-pull output type
    SPIPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD; // No pull-up or pull-down
    SPIPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST; // Fast speed

    // Configure SPI1 pins
    SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_4; // NSS
    GPIO_Init(&SPIPins);

    SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_5; // SCK
    GPIO_Init(&SPIPins);

     SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_6; // MISO
     GPIO_Init(&SPIPins);

    SPIPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_7; // MOSI
    GPIO_Init(&SPIPins);
}

void SPI1_Inits() {
    SPI_Handle_t SPI1Handle;

    SPI1Handle.pSPIx = SPI1;
    SPI1Handle.SPIConfig.SPI_BusConfig = SPI_BUS_CONFIG_FD;
    SPI1Handle.SPIConfig.SPI_DeviceMode = SPI_DEVICE_MODE_MASTER;
    SPI1Handle.SPIConfig.SPI_SclkSpeed = SPI_SCLK_SPEED_DIV32;
    SPI1Handle.SPIConfig.SPI_DS = SPI_DS_8BITS;
    SPI1Handle.SPIConfig.SPI_CPOL = SPI_CPOL_LOW;
    SPI1Handle.SPIConfig.SPI_CPHA = SPI_CPHA_LOW;
    SPI1Handle.SPIConfig.SPI_SSM = SPI_SSM_DI; // Disable software slave management

    SPI_Init(&SPI1Handle);
}
